open-flights/app/controllers/api/v1/airlines_controller.rb

SELECT "airlines".* FROM "airlines"
---
            def index
                airlines = Airline.all

SELECT "airlines".* FROM "airlines" WHERE "airlines"."slug" = ? LIMIT ?  [["slug", "fake-airline"], ["LIMIT", 1]]
---
            def show
                airline = Airline.find_by(slug: params[:slug])

INSERT INTO "airlines" ("name", "image_url", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "fake airline"], ["image_url", nil], ["slug", "fake-airline"], ["created_at", "2024-04-25 19:17:50.104641"], ["updated_at", "2024-04-25 19:17:50.104641"]]
---
            def create
                airline = Airline.new(airline_params)

                if airline.save

SELECT "airlines".* FROM "airlines" WHERE "airlines"."slug" = ? LIMIT ?  [["slug", "fake-airline"], ["LIMIT", 1]]
UPDATE "airlines" SET "name" = ?, "updated_at" = ? WHERE "airlines"."id" = ?  [["name", "other fake airline"], ["updated_at", "2024-04-25 19:19:53.313112"], ["id", 5]]
---
            def update
                airline = Airline.find_by(slug: params[:slug])

                if airline.update(airline_params)

SELECT "airlines".* FROM "airlines" WHERE "airlines"."slug" = ? LIMIT ?  [["slug", "fake-airline"], ["LIMIT", 1]]
DELETE FROM "airlines" WHERE "airlines"."id" = ?  [["id", 5]]
---
            def destroy
                airline = Airline.find_by(slug: params[:slug])

                if airline.destroy